Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_I2C1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void Debug(char *Array, int count);														//Sends something to UART1 for debugging
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart);				//Sends error message with Debug()
void SetupTimers(void);																				//Configure timers 6 and 7 for use in servo control
void Sort(void);																							//Sorts timer values into ascending order
void SetServo(int servo, int degrees);												//Sets the timer value for a servo from a degree value
struct servos IK( struct coordinates input);									//Inverse Kinematics function
void CheckBounds(void);																				//Check if legs need to be reset
struct coordinates Rotate(double x, double y, double angle);	//Rotate coordinates about an angle
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART3_UART_Init();
  MX_USART1_UART_Init();
  MX_TIM6_Init();
  MX_TIM7_Init();
  MX_I2C1_Init();

  /* USER CODE BEGIN 2 */
	SetServo(1,90);
	SetServo(2,90);
	SetServo(3,90);
	SetServo(4,90);
	SetServo(5,90);
	SetServo(6,160);
	SetServo(7,160);
	SetServo(8,160);
	SetServo(9,160);
	SetServo(10,160);
	SetServo(11,70);
	SetServo(12,70);
	SetServo(13,70);
	SetServo(14,70);
	SetServo(15,70);
	SetupTimers();
	Debug("Init done",9);
	//Turn off all LEDs except green
	HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(greenLEDPort,greenLEDPin,GPIO_PIN_SET);
	HAL_GPIO_WritePin(redLEDPort,redLEDPin,GPIO_PIN_RESET);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	//Set servo begin positions

	
	Debug("Entering main loop",18);
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
//		HAL_GPIO_WritePin(GPIOE,GPIO_PIN_0,GPIO_PIN_SET);					//Turn blue LED off
		HAL_UART_Receive_IT(&huart3,RXData,15);											//Receive commands via bluetooth
		for(int i = 0;i<7;i++)
		{
			//Is this a valid message?
			if ((RXData[i] == 'X')&& (RXData[i+2] == 'Y')&&(RXData[i+4]=='R')&&(RXData[i+6]=='*'))
			{
				//Turn Blue LED on
				HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_RESET);
				HAL_GPIO_WritePin(servoPowerPort,servoPowerPin,GPIO_PIN_SET);
				BTCount = 0;
				//Extract the necessary commands
				X_Char = RXData[i+1];
				Y_Char = RXData[i+3];
				R_Char = RXData[i+5];
				//Clear the array
				for(int j = 0;j<14;j++)
				{
					RXData[j]=0;
				}
				//Calculate correct vectors
				X_Vect = X_Char - '5';
				Y_Vect = Y_Char - '5';
				R_Vect = R_Char - '5';
				//Debug
				HAL_UART_Transmit(&huart1,&X_Char,1,10);
				HAL_UART_Transmit(&huart1,&Y_Char,1,10);
				HAL_UART_Transmit(&huart1,&R_Char,1,10);
				HAL_UART_Transmit(&huart1,BTRewrite,4,10);
				}
		}
		
		//Toggle pin to check for stuck program
		HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_1); 
		
		//Do leg stuff
		struct coordinates leg1;
		struct servos leg1_angles;
		leg1.x = 10;
		leg1.y = 200;
		leg1.z = 0;
		leg1_angles = IK(leg1);
		struct coordinates leg2;
		leg2 = Rotate(1,1,90);
		
  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 10;
  RCC_OscInitStruct.PLL.PLLN = 216;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Activate the Over-Drive mode 
    */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART3
                              |RCC_PERIPHCLK_I2C1;
  PeriphClkInitStruct.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInitStruct.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
  PeriphClkInitStruct.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

