Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
  /*Configure GPIO pins : PE0 PE1 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

void Debug(char *Array, int count)
{
	uint8_t TXBuffer[count+1];
	for(int i = 0; i!=count;i++)
	{
		TXBuffer[i] = Array[i];
	}		
	
	TXBuffer[count] ='\r';
	TXBuffer[count+1] ='\n';
	HAL_UART_Transmit(&huart1,TXBuffer,count+2,10);
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	Debug("Bluetooth Error",15);
}
	
void SetupTimers(void)
{
	//Timer 6
	//50Hz Interrupt
	ServoTimer.Instance =TIM6;
	ServoTimer.Init.Prescaler =40000;
	ServoTimer.Init.CounterMode = TIM_COUNTERMODE_UP;
	ServoTimer.Init.Period =54;
	ServoTimer.Init.RepetitionCounter = 0;
	HAL_TIM_Base_Init(&ServoTimer);
	HAL_TIM_Base_Start_IT(&ServoTimer);
	
	//Timer 7
	//Variable frequency interrupt
	htim7.Instance =TIM7;
	htim7.Init.Prescaler =1000;
	htim7.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim7.Init.Period =160;
	htim7.Init.RepetitionCounter = 0;
	HAL_TIM_Base_Init(&htim7);
	HAL_TIM_Base_Start_IT(&htim7);
}
	

/** @brief Function for sorting the desired leg angles into ascending order 
						to make timer functions simpler
  * @param None
  * @retval None */
void Sort(void)
{
	for(int i = 0;i<15;i++)
	{
		for(int j = i+1;j<15;j++)
		{
			if(legAngles[i] > legAngles[j])
			{
				//swop the angles
				int a = legAngles[i];
				legAngles[i] = legAngles[j];
				legAngles[j] = a;
				//now swop the index
				a = legAngles_id[i];
				legAngles_id[i] = legAngles_id[j];
				legAngles_id[j] = a;
			}
		}
	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
	{
		
		if(htim == &htim7){
			//Turn off
			++servoCount;
			
			if (servoCount < 15)
			{
				newPeriod = (legAngles[servoCount]- legAngles[servoCount-1]);
				
				while (newPeriod == 0)
				{
					HAL_GPIO_WritePin(servoPortArray[legAngles_id[servoCount-1]-1] ,servoPinArray[legAngles_id[servoCount-1]-1],GPIO_PIN_RESET);
					++servoCount;
					newPeriod = (legAngles[servoCount]- legAngles[servoCount-1]);
				}
				//TIM7->CNT = 0;
				if (newPeriod>1)
				{
					--newPeriod;
				}
				TIM7->ARR = (newPeriod);
				HAL_GPIO_WritePin(servoPortArray[legAngles_id[servoCount-1]-1] ,servoPinArray[legAngles_id[servoCount-1]-1],GPIO_PIN_RESET);
			}else{
				//Turn off servo 15
				HAL_GPIO_WritePin(servoPortArray[legAngles_id[14]-1] ,servoPinArray[legAngles_id[14]-1],GPIO_PIN_RESET);
				//Stop the timer for the rest of the cycle
				HAL_TIM_Base_Stop(&htim7);
				servoCount = 0;
			}
		}
		if (htim == &htim6)
		{
			//50Hz Interrupt
			//HAL_GPIO_TogglePin(redLEDPort,redLEDPin);
			//Turn all on
			HAL_GPIO_WritePin(servo1Port,servo1Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo2Port,servo2Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo3Port,servo3Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo4Port,servo4Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo5Port,servo5Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo6Port,servo6Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo7Port,servo7Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo8Port,servo8Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo9Port,servo9Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo10Port,servo10Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo11Port,servo11Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo12Port,servo12Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo13Port,servo13Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo14Port,servo14Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(servo15Port,servo15Pin,GPIO_PIN_SET);
			
			//Sort the servo times in ascending order
			Sort();
			//Set period for 1st servo
			newPeriod = legAngles[servoCount];
			while (newPeriod == 0)
			{
				++servoCount;
				newPeriod = legAngles[servoCount];
			}
				
			TIM7->ARR = newPeriod;
			//Start the timer
			HAL_TIM_Base_Start(&htim7);
			
			//BT LED
			++BTCount;
			if (BTCount > 120) //20ms * 120 = 2.4s
			{
				//Turn LED off
				HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(servoPowerPort,servoPowerPin,GPIO_PIN_RESET);
				BTCount = 0;
				HAL_GPIO_TogglePin(greenLEDPort,greenLEDPin);
				HAL_GPIO_TogglePin(redLEDPort,redLEDPin);
			}
		}
	}

	
	void SetServo(int servo, int degrees)
	{
		//Set the servo with the correct index in the array 
		for (int i = 0; i<15; i++)
		{
			if (servo == legAngles_id[i])
			{
				legAngles[i] =servoOffset[servo-1] + (degrees*(servoMultiplier[servo-1])/180);
			}
		}
	}
	
	struct servos IK( struct coordinates input)
	{
		//make the return struct
		struct servos result;
		//Calculate theta
		double theta = atan2(input.x,input.y);
		//Calculate coordinates of joint 2
		double x = A_length * sin(theta);
		double y = A_length * cos(theta);
		//horizontal distance from joint 1 to foot
		double reach = sqrt(pow(input.x-x,2)+pow(input.y-y,2));
		//Absolute distance between joint 2 and foot
		double twoToFoot = sqrt(pow(input.x-x,2)+pow(input.y-y,2) +pow(input.z-z_body,2));
		//perform Cosine rule to get alpha
	  double f =((pow(B_length ,2) + pow(C_length,2) - pow(twoToFoot ,2))/(2*B_length*C_length));
		double d = acos(f);
		double alpha =(rad2deg * d) + 0.5;		//+0.5 for rounding
		result.alpha = (int)alpha;
		//use sine rule to get phi
		double c = asin(C_length * sin(d) / twoToFoot);
		double e = atan2(reach ,z_body-input.z);
		double phi = 270 - c*rad2deg - e*rad2deg + 0.5; // +0.5 for rounding
		result.phi = (int)phi;
		//convert theta to degrees. Add 0.5 for rounding
		theta = (theta * rad2deg) + 0.5;
		result.theta = (int)theta;
		
		return result;
	}
	
	void CheckBounds(void)
	{
		for(int i = 0 ; i<5 ; i++)
		{
			//
			if ( legAngles[i+1] < 50 || legAngles[i+1] > 120		// 50 < theta < 120
				|| legAngles[i+6] < 90 || legAngles[i+6] > 170		// 90 < phi   < 170
				|| legAngles[i+11]< 70 || legAngles[i+11]> 130)		// 70 < alpha < 130
			{
				resetStatus[i] = true;				
			}else{
				resetStatus[i] = false;
			}
		}			
	}
	
