Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
	struct coordinates Rotate(double x, double y, double angle)
	{
		//Create output struct
		struct coordinates result;
		//convert angle to radians
		angle = angle/rad2deg;
		//calculate return values
		result.x = x * cos(angle) - y * sin(angle);
		result.y = x * sin(angle) + y * cos(angle);
		
		return result;		
	}
	
	void Vector(void)
	{
		double trajectory = atan2(Y_Vector,X_Vector);
		for(int leg = 0; leg < 5; leg++)
		{
			//Rotateleg
			struct coordinates neutral = Rotate(0,120,leg*72);
			
		}
		
		
	}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }

	
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
